wosayttn/lv_port_nuvoton/misc/numaker-hmi-m55m1_caffee_wvga/lv_port/lv_glue.h
/**************************************************************************//**
 * @file     lv_glue.c
 * @brief    lvgl glue header
 *
 * SPDX-License-Identifier: Apache-2.0
 * @copyright (C) 2020 Nuvoton Technology Corp. All rights reserved.
 *****************************************************************************/
#ifndef __LV_GLUE_H__
#define __LV_GLUE_H__

#include <stdio.h>
#include <string.h>
#include "NuMicro.h"
#include "lvgl.h"
#include "nu_misc.h"
#include "FreeRTOS.h"
#include "task.h"
#include "semphr.h"

#define PORT_OFFSET   0x40

/* Define off-screen line buffer number,  Range: 1~LV_VER_RES_MAX */
#define CONFIG_DISP_LINE_BUFFER_NUMBER  (LV_VER_RES_MAX/2)

#if (CONFIG_DISP_LINE_BUFFER_NUMBER < 1) || (CONFIG_DISP_LINE_BUFFER_NUMBER > LV_VER_RES_MAX)
    #error "Wrong CONFIG_DISP_LINE_BUFFER_NUMBER definition"
#endif

#define GPIO_PIN_DATA              GPIO_PIN_DATA_S
#define CONFIG_DISP_EBI            EBI_BANK0

#if defined(CONFIG_DISP_USE_EBI_SYNC)

    #define CONFIG_DISP_VPW_ACTIVE_LOW        1   /*!< Enable VPW active low */
    #define CONFIG_DISP_HPW_ACTIVE_LOW        1   /*!< Enable HPW active low */
    #define CONFIG_DISP_DE_ACTIVE_LOW         0   /*!< Disable DE active low */

    #define CONFIG_DISP_VSYNC_BITIDX          1   /*!< SET_EBI_ADR0_PH7 */
    #define CONFIG_DISP_HSYNC_BITIDX          2   /*!< SET_EBI_ADR1_PH6 */
    #define CONFIG_DISP_DE_BITIDX             8   /*!< SET_EBI_ADR7_PH0 */

    #if defined(__800x480__)
        #define CONFIG_TIMING_HACT          800   /*!< XRES */
        #define CONFIG_TIMING_VACT          480   /*!< YRES */
        #define CONFIG_TIMING_HBP            88   /*!< HBP (Horizontal Back Porch) */
        #define CONFIG_TIMING_HFP           255   /*!< HFP (Horizontal Front Porch) */
        #define CONFIG_TIMING_HPW           255   /*!< HPW (HSYNC plus width) */
        #define CONFIG_TIMING_VBP            32   /*!< VBP (Vertical Back Porch) */
        #define CONFIG_TIMING_VFP            13   /*!< VFP (Vertical Front Porch) */
        #define CONFIG_TIMING_VPW             3   /*!< VPW (VSYNC width) */
    #elif defined(__480x272__)
        #define CONFIG_TIMING_HACT          480   /*!< XRES */
        #define CONFIG_TIMING_VACT          272   /*!< YRES */
        #define CONFIG_TIMING_HBP            30   /*!< HBP (Horizontal Back Porch) */
        #define CONFIG_TIMING_HFP             5   /*!< HFP (Horizontal Front Porch) */
        #define CONFIG_TIMING_HPW            41   /*!< HPW (HSYNC plus width) */
        #define CONFIG_TIMING_VBP             2   /*!< VBP (Vertical Back Porch) */
        #define CONFIG_TIMING_VFP            27   /*!< VFP (Vertical Front Porch) */
        #define CONFIG_TIMING_VPW            10   /*!< VPW (VSYNC width) */
    #endif

#else

    /* FSA506/LT7381 EBI */
    #define CONFIG_DISP_USE_PDMA
    #define CONFIG_DISP_EBI_ADDR       (EBI_BANK0_BASE_ADDR+(CONFIG_DISP_EBI*EBI_MAX_SIZE))
    #define CONFIG_DISP_CMD_ADDR       (CONFIG_DISP_EBI_ADDR+0x0)
    #define CONFIG_DISP_DAT_ADDR       (CONFIG_DISP_EBI_ADDR+0x2)
    #define CONFIG_DISP_PIN_BACKLIGHT  NU_GET_PININDEX(evGG, 5)
    #define CONFIG_DISP_PIN_RESET      NU_GET_PININDEX(evGH, 6)
    #define DISP_SET_RST               GPIO_PIN_DATA(NU_GET_PORT(CONFIG_DISP_PIN_RESET),     NU_GET_PIN(CONFIG_DISP_PIN_RESET)) = 1
    #define DISP_CLR_RST               GPIO_PIN_DATA(NU_GET_PORT(CONFIG_DISP_PIN_RESET),     NU_GET_PIN(CONFIG_DISP_PIN_RESET)) = 0
    #define DISP_SET_BACKLIGHT         GPIO_PIN_DATA(NU_GET_PORT(CONFIG_DISP_PIN_BACKLIGHT), NU_GET_PIN(CONFIG_DISP_PIN_BACKLIGHT)) = 1
    #define DISP_CLR_BACKLIGHT         GPIO_PIN_DATA(NU_GET_PORT(CONFIG_DISP_PIN_BACKLIGHT), NU_GET_PIN(CONFIG_DISP_PIN_BACKLIGHT)) = 0

#endif

/* ST1663I/FT5316/FT5446 I2C */
#define CONFIG_INDEV_TOUCH_I2C        I2C1
#define CONFIG_INDEV_TOUCH_PIN_IRQ    NU_GET_PININDEX(evGF, 6)
#define CONFIG_INDEV_TOUCH_PIN_RESET  NU_GET_PININDEX(evGD, 10)
#define INDEV_TOUCH_SET_RST           GPIO_PIN_DATA(NU_GET_PORT(CONFIG_INDEV_TOUCH_PIN_RESET), NU_GET_PIN(CONFIG_INDEV_TOUCH_PIN_RESET)) = 0
#define INDEV_TOUCH_CLR_RST           GPIO_PIN_DATA(NU_GET_PORT(CONFIG_INDEV_TOUCH_PIN_RESET), NU_GET_PIN(CONFIG_INDEV_TOUCH_PIN_RESET)) = 1

int lcd_device_initialize(void);
int lcd_device_finalize(void);
int lcd_device_open(void);
void lcd_device_close(void);
int lcd_device_control(int cmd, void *argv);

int touchpad_device_initialize(void);
int touchpad_device_finalize(void);
int touchpad_device_open(void);
int touchpad_device_read(lv_indev_data_t *psInDevData);
void touchpad_device_close(void);
int touchpad_device_control(int cmd, void *argv);
void sysDelay(uint32_t ms);

#endif /* __LV_GLUE_H__ */
